app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users_history_records".* FROM "users_history_records" WHERE "users_history_records"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(current_user.id)

    @record = @user.users_history_record.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users_history_records".* FROM "users_history_records" WHERE "users_history_records"."user_id" = $1  [["user_id", 1]]
---
  def create
    @user = User.find(current_user.id)

    @record = @user.users_history_record.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users_history_records" ("operation_type", "amount", "balance_after", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["operation_type", "Deposit"], ["amount", 40.0], ["balance_after", 80.0], ["created_at", "2020-11-09 12:00:52.637906"], ["updated_at", "2020-11-09 12:00:52.637906"], ["user_id", 1]]
---
  def deposit(amount)
    @user = User.find(current_user.id)

    if User.deposit(amount, @user)
      CashMachine.add_cash(amount)

      @record = @user.users_history_record.build(operation_type: 'Deposit', amount: amount, balance_after: @user.current_balance)

      @record.save ? true : false

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users_history_records" ("operation_type", "amount", "balance_after", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["operation_type", "Withdraw"], ["amount", 60.0], ["balance_after", 20.0], ["created_at", "2020-11-09 12:00:59.545828"], ["updated_at", "2020-11-09 12:00:59.545828"], ["user_id", 1]]
---
  def withdraw(amount = 0)
    @user = User.find(current_user.id)

    if User.withdraw(amount, @user)
      @record = @user.users_history_record.build(operation_type: 'Withdraw', amount: amount, balance_after: @user.current_balance)

      @record.save ? true : false